portotools/examples/portoshell/http/html/tutorial.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
               "http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>Porto tutorial</title>
<meta http-equiv="Content-Type" content="text/html;charset=utf-8"/>
<meta name="title" content="Porto tutorial"/>
<meta name="generator" content="Org-mode"/>
<meta name="generated" content="2014-06-20T18:48+0200"/>
<meta name="author" content="Thomas Hagelien"/>
<meta name="description" content=""/>
<meta name="keywords" content=""/>

</head>
<body>

<div id="preamble">

</div>

<div id="content">
<h1 class="title">Porto tutorial</h1>

<p>Dette er en test
</p>

<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">1 A brief introduction to portoshell</a>
<ul>
<li><a href="#sec-1-1">1.1 Standard Build in utility extensions</a></li>
<li><a href="#sec-1-2">1.2 External modules</a></li>
<li><a href="#sec-1-3">1.3 Plugin-in support (C++)</a></li>
</ul>
</li>
<li><a href="#sec-2">2 Creating your first script</a></li>
<li><a href="#sec-3">3 Working with metadata</a>
<ul>
<li><a href="#sec-3-1">3.1 Example: Unit metadata</a></li>
<li><a href="#sec-3-2">3.2 Creating instances of entities</a></li>
<li><a href="#sec-3-3">3.3 Storing data to the database</a></li>
<li><a href="#sec-3-4">3.4 Reading data back from a database</a></li>
<li><a href="#sec-3-5">3.5 Introducing Collections</a></li>
<li><a href="#sec-3-6">3.6 Introducing the Porto MVC code generator</a></li>
<li><a href="#sec-3-7">3.7 Summary</a></li>
</ul>
</li>
<li><a href="#sec-4">4 Working with OpenFOAM</a>
<ul>
<li><a href="#sec-4-1">4.1 Defining meta-data</a></li>
<li><a href="#sec-4-2">4.2 Storing the meta-data</a></li>
<li><a href="#sec-4-3">4.3 Instanciate an ControlDict entity</a></li>
<li><a href="#sec-4-4">4.4 Create the template view for the generated file</a></li>
<li><a href="#sec-4-5">4.5 Generate a controlDict file</a></li>
</ul>
</li>
<li><a href="#sec-5">5 Using UDP to communicate and run external processes</a></li>
<li><a href="#sec-6">6 Displaying contents in a web browser</a></li>
<li><a href="#sec-7">7 Final notes</a></li>
</ul>
</div>
</div>

<div id="outline-container-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> A brief introduction to portoshell</h2>
<div class="outline-text-2" id="text-1">


<p>
Portoshell is a scripting tool for performing various tasks related to
the NanoSim platform development, data and process management and
simulator connectivity. The scripting language is based on ECMAScript,
better known as JavaScript (although the language is not related to
Java, and has a completely different semantics). For more background
on the JavaScript language, please consult your nearest google search
engine.
</p>
<p>
In addition the being ECMA-262 compatible, the Portoshell also
supports custom extensions. These comes in different flavours:
</p>
<ul>
<li>Standard build-in utility extensions (modules)
</li>
<li>External modules (written JavaScript)
</li>
<li>Plugin-in support (Written or wrapped in C++)
</li>
</ul>



</div>

<div id="outline-container-1-1" class="outline-3">
<h3 id="sec-1-1"><span class="section-number-3">1.1</span> Standard Build in utility extensions</h3>
<div class="outline-text-3" id="text-1-1">

<p>Add the current moment of writing, the Porto standard build-in modules are
</p><ul>
<li>Process Module
</li>
<li>EventLoop Module
</li>
<li>UDP Socket Module
</li>
<li>Console Module
</li>
<li>File System Module
</li>
<li>File System Watcher Module
</li>
<li>Httpd Module 
</li>
</ul>


<p>
These modules are considered core featured and provide functionality
to increase producitivy.
</p>
</div>

</div>

<div id="outline-container-1-2" class="outline-3">
<h3 id="sec-1-2"><span class="section-number-3">1.2</span> External modules</h3>
<div class="outline-text-3" id="text-1-2">

<p>The external JavaScript modules are extensions that are easy to
manipulate and reload at runtime. They are containers of data and
functions that can be loaded through the build-in function:
</p>



<pre class="example">require (modulename)
</pre>


<p>
The modulename can either be a javascript file, or a modulename including namespace
</p>



<pre class="example">require ('porto.mvc');  // fetching a registered module
</pre>



<pre class="example">require ('/path/to/file.js'); // fetching a module scriptfile
</pre>


<p>
The difference between a module and a regular script file is that a
module is captured within a javascript closure, accessing an object
named 'exports'. Only variables and functions that are set as
properties to exports will be available from the callee. This avoids
naming pollution and provides nice module APIs.
</p>



<pre class="example">(function (mymodule){
  mymodule.hello = function (){ 
    console.log ("Hello Porto Modules!");
  }
})(exports);
</pre>



<pre class="example">require('mymodule.js').hello();
// =&gt; Hello Porto Modules!
</pre>


<p>
At the time of writing we currently have the following 'standard'
external modules:
</p>
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">
<colgroup><col class="left" /><col class="left" />
</colgroup>
<thead>
<tr><th scope="col" class="left">Module</th><th scope="col" class="left">Description</th></tr>
</thead>
<tbody>
<tr><td class="left">porto.entity</td><td class="left"><i>Simplifies working with entities</i></td></tr>
<tr><td class="left">porto.collection</td><td class="left"><i>Defines the API for Collections</i></td></tr>
<tr><td class="left">porto.macro</td><td class="left"><i>Macro expansion module</i></td></tr>
<tr><td class="left">porto.mvc</td><td class="left"><i>Model View Controller code generator framework</i></td></tr>
<tr><td class="left">porto.storage</td><td class="left"><i>Storage context class with factory</i></td></tr>
<tr><td class="left">porto.storage.json</td><td class="left"><i>Experimental ultralight JSON storage extension</i></td></tr>
<tr><td class="left">porto.storage.mongo</td><td class="left"><i>MongoDB wrapper utility</i></td></tr>
<tr><td class="left">porto.utils.metastore</td><td class="left"><i>Utility for storing metadata in the metadata database</i></td></tr>
<tr><td class="left">porto.factory.entity</td><td class="left"><i>Factory for dynamic runtime generation of entity classes</i></td></tr>
</tbody>
</table>



</div>

</div>

<div id="outline-container-1-3" class="outline-3">
<h3 id="sec-1-3"><span class="section-number-3">1.3</span> Plugin-in support (C++)</h3>
<div class="outline-text-3" id="text-1-3">

<p>The last method of extending Portoshell is through pre-compiled
plugins that are loaded at startup. These plugins can provide access
to C/C++/++ libraries through C++/Scripting interfaces. Details of how
this is performed is beyond the scope of this tutorial. There is
currently only on plug-in available in Porto, namely the
<i>MongoDB-plugin</i> which gives a low-level access to the mongodb
C-driver API.
</p>

</div>
</div>

</div>

<div id="outline-container-2" class="outline-2">
<h2 id="sec-2"><span class="section-number-2">2</span> Creating your first script</h2>
<div class="outline-text-2" id="text-2">


<p>
In this section you will be introduced to scripting in portoshell. We'll start with the cliché hello-world:
</p>



<pre class="example">__main__ = function (args)
{
    print ("Hello, World");
}
</pre>


<p>
To execute this script from command-line, save this script to a file <i>hello.js</i> and call
</p>



<pre class="example">portoshell hello.js
</pre>


<p>
The key idea here is that the script file will need to have defined an entry body
</p>



<pre class="example">__main__ = function (args)
</pre>


<p>
that will be called from the script engine. 
</p>
<p>
If no arguments are given to portoshell, you will start the interactive
REPL (Read-evaluate-print-loop). This is a useful environment for
experimenting and interactive development.
</p>



<pre class="example">$ portoshell
PortoShell 0.1.32
Source license: LGPLv3

For help, type :help

&gt; print ("Hello");
Hello
undefined
&gt; 

</pre>


<p>
Notice the text <i>undefined</i> that gets printed after the output is
written. This is return value of the expression evaluation. If the
expression doesn't return av valid value, the value <i>undefined</i> gets
written.
</p>

</div>

</div>

<div id="outline-container-3" class="outline-2">
<h2 id="sec-3"><span class="section-number-2">3</span> Working with metadata</h2>
<div class="outline-text-2" id="text-3">


<p>
Now you have the fundamentals covered to get started working with data
and metadata. Meta-data is a high-level description of data that
identifies how data from any source can be interpreted. Meta-data
should be uniquely indentified with a name and version
number. Furthermore, the metadata should defined a list of properties
that identifies names, type, units, dimensions etc for each element.
</p>

</div>
