portotools/examples/portoshell/http/html/tutorial.html

<div id="outline-container-3-1" class="outline-3">
<h3 id="sec-3-1"><span class="section-number-3">3.1</span> Example: Unit metadata</h3>
<div class="outline-text-3" id="text-3-1">

<p>Let's start with a simple example: Define meta-data for the entity
<i>unit</i>. The unit-entity should contain the following fields:
</p>
<ul>
<li>abbreviation
</li>
<li>code
</li>
<li>conversionMultiplier
</li>
<li>conversionOffset
</li>
<li>quantityKind
</li>
<li>symbol
</li>
<li>unit
</li>
</ul>


<p>  
This follows the structure defined by <a href="http://qudt.org/">QUDT</a>
</p>
<p>
The formal meta-entity is specified in JSON like this:
</p>



<pre class="example">{
    "name": "unit",
    "version": "1.0-SNAPSHOT-1",
    "description": "Unit definitions",
    "properties": [
       {
         "name": "abbreviation",
         "type": "string"
       },
       {
         "name": "code",
         "type": "string"
       },
       {
         "name": "conversionMultiplier",
         "type": "double"
       },
       {
         "name": "conversionOffset",
         "type": "double"
       },
       {
         "name": "quantityKind",
         "type": "string"
       },
       {
         "name": "symbol",
         "type": "string"
       },
       {
         "name": "unit",
         "type": "string"
       }
    ]
}
</pre>


<p>
Save this contents in a file named 'unit.json'. To insert this file
into the meta-database, perform the following operation from a shell
</p>



<pre class="example">$ register-entity.sh unit.json

2014/06/14 15:00:40.0110: [18265]: INFO: cluster: Client
initialized in direct mode.
{"name":"unit","version":"1.0-SNAPSHOT-1","description":"Unit     
definitions","properties":[{"name":"abbreviation","type":"string"},
{"name":"code","type":"string"},{"name":"conversionMultiplier",
"type":"double"},{"name":"conversionOffset","type":"double"},{"name":
"quantityKind","type":"string"},{"name":"symbol","type":"string"},
{"name":"unit","type":"string"}]}
</pre>


<p>
The <i>register-entity.sh</i> script is a utility that inserts a json-file
into MongoDB. If we take a look at the file <i>register-entity.sh</i>, you
will find that this is not a regular shell-script at all, but a script
that actually gets run by portoshell
</p>



<pre class="example">#!/usr/bin/env portoshell

/*
 * register-entity.sh
 * A utility to commit meta-data into the metadata-database
 */

__main__ = function (args)
{
    if (args.length == 0) {
           console.error("fatal error: no input files");
           return undefined;
       }
    var metaStorage = require ('porto.utils.metastore').connect(
        {
            uri: 'mongodb://localhost',
            database: 'meta',
            collection: 'entities'
        });
    args.forEach(function(file){
        fs.readFile(file, function(err, data) {
            if (err) {
                print ("error:", err);
                return;
            }
            if (!metaStorage.store (data)) {
                print ("Failed to write data");
            }
        });
    });
}

</pre>


<p>
If you look closely, you will see that our meta-database is (here)
hard-coded to be the database: '<i>meta</i>', collection: '<i>entities</i>' in a
mongodb server running on <i>localhost</i>. Don't worry if you don't
understand the rest of the script.
</p>
<p>
The file <i>all-units.json</i> is a collection of all the documented units
available from <a href="#qudt.org">qudt.org</a>. Our goal now is to create an instance of the
entity <i>Unit</i>, fill it with the contents of the existing data, and
store the data as an entity in MongoDB.
</p>
</div>

</div>

<div id="outline-container-3-2" class="outline-3">
<h3 id="sec-3-2"><span class="section-number-3">3.2</span> Creating instances of entities</h3>
<div class="outline-text-3" id="text-3-2">


<p>
Creating an entity of type unit can now be performed runtime in the scripting environment:
</p>



<pre class="example">var entity = require('porto.entity').db(driverInfo);   
Unit       = entity.using('unit', '1.0-SNAPSHOT-1');
</pre>


<p>
Notice that we never implement the object <i>Unit</i>. This is generated
for us, based on the metadata that we just stored. The return value
from <i>entity.using</i> is actually the <i>Unit.protocol.constructor</i>
reference.  The variable '<i>u</i>' is now holding a new instance of the
class '<i>Unit</i>'. It is also possible to call createEntity with a
callback function that will capture errors and the class definition
(the function that creates the class passed as text).
</p>

</div>

</div>

<div id="outline-container-3-3" class="outline-3">
<h3 id="sec-3-3"><span class="section-number-3">3.3</span> Storing data to the database</h3>
<div class="outline-text-3" id="text-3-3">


<p>
The storage where we want to store the entity values could be a number
of different locations. The storage-module contains a factory pattern
that allows us to specify the name of the driver we want to use,
together with other info. We are not bound to a single driver such as
MongoDB at this point. Any supported driver can be loaded runtime and
used for storage and data retrieval.
</p>



<pre class="example">/* connectivity information */
var driverInfo = {
    driver:     'mongodb',
    database:   'porto',
    collection: 'units'
};
</pre>


<p>
In this case we want to store our data in a database called '<i>porto</i>',
in a collection we call '<i>mydata</i>'.  Let's fill an entity with some
data and store the contents to the database:
</p>



<pre class="example">var unit = new Unit();
u.set({
    abbreviation: "Gy/s",
    code: "0780",
    conversionMultiplier: "1.0e0",
    conversionOffset: "0.0",
    quantityKind: "quantity:AbsorbedDoseRate",
    symbol: "Gy/s",
    unit: "GrayPerSecond"
});
</pre>


<p>
The <i>Unit</i> object is generated with a set of getter and setter
functions. We could equally well have written something like this:
</p>



<pre class="example">...
u.setAbbrevation ("Gy/s");
u.setCode ("0780");

...
</pre>


<p>
To finalize the process, we can now store the data as a value in our database:
</p>



<pre class="example">u.store();
</pre>


<p>
The complete example should now look like this:
</p>



<pre class="example">/* connectivity information */
var driverInfo = {
    driver:     'mongodb',
    database:   'porto',
    collection: 'units'
};

/* Entity creator */
var entity = require('porto.entity').db(driverInfo);   
Unit       = entity.using('unit', '1.0-SNAPSHOT-1');

var u = new Unit();

u.set({
    abbreviation: "Gy/s",
    code: "0780",
    conversionMultiplier: "1.0e0",
    conversionOffset: "0.0",
    quantityKind: "quantity:AbsorbedDoseRate",
    symbol: "Gy/s",
    unit: "GrayPerSecond"
});

u.store();
print (u.id);
</pre>


<p>
In this example we've seen how an entity can be generated runtime for
us, based on meta-data. In other languages, the code generation might
have to be performed compile-time, and included in the code-base. This
is, however, semantically equal to what we've shown here. The key
concept is that '<i>meta-data</i>' defines the schema, the storage driver
is completely seperated from the implementation of the Entity
instance, and the correct coupling can be performed runtime, giving
extreme flexibility.
</p>
<p>
The last command in the example prints the unique identifier of the
entity. This value as an <a href="http://en.wikipedia.org/wiki/Universally_unique_identifier">universally unique identifier</a> and needs to be
communicated between processes that work with the same data.
</p>
</div>

</div>
