portotools/examples/portoshell/http/html/tutorial.html

<div id="outline-container-3-4" class="outline-3">
<h3 id="sec-3-4"><span class="section-number-3">3.4</span> Reading data back from a database</h3>
<div class="outline-text-3" id="text-3-4">


<p>
Our storage device have defined both read and write operations, so we
can reuse our storage from the previous example. To read back data
(from a different application) we can simply instanciate our entity
with the UUID generated be the instance.
</p>



<pre class="example">/* let's pretend the UUID we got was
8dd10147-d0b9-48ee-ae9b-2ef41d56add9 */

var id = '8dd10147-d0b9-48ee-ae9b-2ef41d56add9';
var entity = require('porto.entity').db(driverInfo);   
Unit       = entity.using('unit', '1.0-SNAPSHOT-1');

var u = new Unit(id);    
</pre>


<p>
Notice that working Porto doesn't really require the developer to
fight a lot of different APIs. Hiding the boilerplate code in
configuration files leaves the developers to simply instanciate a
class/module/object and start working with the data in a language
native way.
</p>
<p>
There is another important thing to consider as well. In our client
code we have said (made a contract) that we want to use the entity
<i>unit:1.0-SNAPHOT-1</i>. However, we don't say anything about the source
type. This is one of the more sophisticated features of the Porto
design. If the datasource that stored the contents of the entity with
the id= '<i>8dd10147-d0b9-48ee-ae9b-2ef41d56add9</i>', was of a different
kind, the framework would notice that the client entity and source
entity was different, and it would search for an explicit
<i>translator</i>. The translators are simply code that accepts a given
entity type and returns a different one. The client code will never
have to include its own version control to accomodate for changes in
file formats etc. We can simply just state <i>what</i> entity we want to
use, and that's the end of that. 
</p>
</div>

</div>

<div id="outline-container-3-5" class="outline-3">
<h3 id="sec-3-5"><span class="section-number-3">3.5</span> Introducing Collections</h3>
<div class="outline-text-3" id="text-3-5">


<p>
Collections are simply a formal specification of an entity that
contains information about other entities and their relations. One of
the key design principles of the Proto data centric design is the
separation of data (entities) and structures (relations). The
Collection constructor is defined in the external module
'/porto.collection'/.
</p>



<pre class="example">Collection = require('porto.collection').db(driverInfo);
var myCollection = new Collection();
</pre>


<p>
The Collection class has the following API
</p>
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">
<colgroup><col class="left" /><col class="left" />
</colgroup>
<thead>
<tr><th scope="col" class="left">Function</th><th scope="col" class="left">Description</th></tr>
</thead>
<tbody>
<tr><td class="left">setName(name)</td><td class="left">Set the collection name</td></tr>
<tr><td class="left">name()</td><td class="left">Get the name of the collection</td></tr>
<tr><td class="left">setVersion(version)</td><td class="left">Set the version of the collection</td></tr>
<tr><td class="left">version()</td><td class="left">Get the version of the collection</td></tr>
<tr><td class="left">count()</td><td class="left">Return the number of registered entities</td></tr>
<tr><td class="left">instances()</td><td class="left">Return the label of each entity instance</td></tr>
<tr><td class="left">findInstance(label)</td><td class="left">Return the entity object with the given label</td></tr>
<tr><td class="left">registerRelation(from,to,rel)</td><td class="left">Creates a relation between two entities</td></tr>
<tr><td class="left">registerEntity(entity,label)</td><td class="left">Registeres an entity with a given (locally unique) label</td></tr>
</tbody>
</table>



<p>
This will create an empty collection.
</p>
<p>
Let's create a script that does the following
</p><ol>
<li>Read the complete file of units 
</li>
<li>Create a collection that should contain the complete set of unit entities
</li>
<li>Create new entities for each unit and store the value
</li>
<li>Register the entity in the collection
</li>
<li>Store the collection and report the UUID:
</li>
</ol>





<pre class="example">var unitsJSON = fs.readFile('units.json', function(err, data){
    if (err) throw(err);

    /* connectivity information */
    var driverInfo = {
        driver:     'mongodb',
        database:   'porto',
        collection: 'units'
    };

    /* Entity and Collection creators */
    Collection = require('porto.collection').db(driverInfo);
    var entity = require('porto.entity').db(driverInfo);   
    Unit       = entity.using('unit', '1.0-SNAPSHOT-1');

    /* Parse the external file into a javascript object */
    var obj = JSON.parse(data);

    /* Instanciate a new Collection class */
    var unitLibrary = new Collection();
    unitLibrary.setName('UnitCollection');
    unitLibrary.setVersion('1.0');

    /* Iterate through all the units and make a call the callback function */
    obj.units != undefined &amp;&amp; obj.units.forEach (function(unitObj) {
        /* Create a new Entity for each element in the list */
        var unitEntity = new Unit();
        unitEntity.set(unitObj);
        unitEntity.store();

        /* Register the entity in the Collection class*/
        unitLibrary.registerEntity (unitEntity, 'entity'+unitEntity.code);
    });

    /* Store the Collection */
    unitLibrary.store();

    /* Display the id of the collection */
    console.log (unitLibrary.id);
});

</pre>


</div>

</div>
