portotools/examples/portoshell/http/html/tutorial.html

<div id="outline-container-3-6" class="outline-3">
<h3 id="sec-3-6"><span class="section-number-3">3.6</span> Introducing the Porto MVC code generator</h3>
<div class="outline-text-3" id="text-3-6">


<p>
The code generator is implemented in the external module
'porto.mvc'. This module contains only one function (<i>create()</i>),
which takes as the argument a model (object) and a view (template
file), and returns a new function that will expand the
javascript-markup contents of the view template and return a
string. The generate method takes a '<i>bag</i>' object as an optional
argument. Every property connected to bag will be available in the
view template js-code. In addition to <i>bag</i>, the porto.model - defined
in the <i>create(obj)</i> function call, will be available.
</p>
<p>
Let's create an example where we instanciate our unit library that we
just stored. Then we pass the collection contents to the view template
which expands the contents from the MongoDB and into a HTML-document,
that will present the unit library as tables.
</p>



<pre class="example">var driverInfo = {
    driver: 'mongodb',
    database: 'porto',
    collection: 'units'
};

Collection = require('porto.collection').db(driverInfo);

/* Instanciate our unitLibrary collection */
var collectionID = '79fe6b02-7b9e-4339-b238-983333b37552';
var unitLibrary  = new Collection(collectionID);

/* Create a generate function*/
var generate = require('porto.mvc').create({
    model: unitLibrary.get(),
    view: 'webtemplate.jshtml'
});

/* Store the result to an output file */
fs.writeFile ('output.html', generate(driverInfo), function(err){
    if (err) throw (err);
});

</pre>


<p>
We will also need our template. It looks a bit ugly, but hey - it is what it is:
</p>



<pre class="example">@{
  var entity = require('porto.entity').db(porto.bag);
  Unit = entity.using('unit', '1.0-SNAPSHOT-1');
  createTable = function(unit){
    return "&lt;table style=\"width:300px\"&gt;&lt;tr&gt;&lt;th colspan=\"2\"&gt;unit:" +
    unit.unit + "&lt;/th&gt;&lt;/tr&gt;&lt;tr&gt;&lt;th&gt;Property&lt;/th&gt;&lt;th&gt;Value&lt;/th&gt;&lt;/tr&gt;&lt;tr&gt;&lt;td&gt;abbreviation&lt;/td&gt;&lt;td&gt;"+
    unit.abbreviation+"&lt;/td&gt;&lt;/tr&gt;&lt;tr&gt;&lt;td&gt;code&lt;/td&gt;&lt;td&gt;"+
    unit.code+"&lt;/td&gt;&lt;/tr&gt;&lt;tr&gt;&lt;td&gt;conversionMultiplier&lt;/td&gt;&lt;td&gt;"+
    unit.conversionMultiplier+"&lt;/td&gt;&lt;/tr&gt;&lt;tr&gt;&lt;td&gt;conversion offset&lt;/td&gt;&lt;td&gt;"+
    unit.conversionOffset + "&lt;/td&gt;&lt;/tr&gt;&lt;tr&gt;&lt;td&gt;quantityKind&lt;/td&gt;&lt;td&gt;"+
    unit.quantityKind+"&lt;/td&gt;&lt;/tr&gt;&lt;tr&gt;&lt;td&gt;symbol&lt;/td&gt;&lt;td&gt;"+ unit.symbol+"&lt;/td&gt;&lt;/tr&gt;&lt;/table&gt;"
  }
}
&lt;html&gt;
  &lt;head&gt;Generated at @{new Date().toString()}
  &lt;link rel="stylesheet" type="text/css" href="http://www.qudt.org/qudt/owl/1.0.0/styles/nexiom.css"/&gt;
  &lt;/head&gt;
  &lt;body&gt;
    &lt;h1&gt;Generated from @{porto.model.__name__} version @{porto.model.__version__}&lt;/h1&gt;
    The original data is available from &lt;a href="http://www.qudt.org"&gt;qudt&lt;/a&gt;
    @{porto.model.entities.map(function(obj){
      var unit = new Unit(obj.uid);
      return createTable(unit);
    }).join("&lt;br/&gt;");}
  &lt;/body&gt;
&lt;/html&gt;

</pre>


<p>
Run the script and enjoy the results.
</p>
</div>

</div>

<div id="outline-container-3-7" class="outline-3">
<h3 id="sec-3-7"><span class="section-number-3">3.7</span> Summary</h3>
<div class="outline-text-3" id="text-3-7">


<p>
In this chapter we've touched upon some key features of Porto:1
</p><ul>
<li>Defining meta-data schemas and storing them in a database
</li>
<li>Creating instances of entities that are bound the meta-data schema
</li>
<li>Creating collections of entities
</li>
<li>Storing and retreiving data using the generic storage interface
</li>
<li>Generating code based on data contents stored in the MongoDB database
</li>
</ul>


</div>
</div>

</div>

<div id="outline-container-4" class="outline-2">
<h2 id="sec-4"><span class="section-number-2">4</span> Working with OpenFOAM</h2>
<div class="outline-text-2" id="text-4">


<p>
In this chapter we show how Porto can be used to generate inputs for
OpenFOAM. This is a partial example and should be extended to a
complete simulation environment run from within Porto.
</p>

</div>

<div id="outline-container-4-1" class="outline-3">
<h3 id="sec-4-1"><span class="section-number-3">4.1</span> Defining meta-data</h3>
<div class="outline-text-3" id="text-4-1">

<p>As always, we start with the data modelling and implementing our
meta-data schemas. The simplest OpenFOAM entity to define is proably
the OpenFOAM control dictionary <i>controlDict</i>
</p>
<p>
We could be more explicit in the definition and give the properties
units etc. It would also be better to use enumerators instead of
string-types for some of the properties.
</p>



<pre class="example">{
    "name"        : "controlDict",
    "version"     : "0.1",
    "description" : "Time and data input/output control",
    "properties"  : [
        {
            "name": "application",
            "type": "string"
        },
        {
            "name": "startFrom",
            "type": "string"
        },
        {
            "name": "startTime",
            "type": "double"
        },
        {
            "name": "stopAt",
            "type": "string"
        },
        {
            "name": "endTime",
            "type": "double"
        },
        {
            "name": "deltaT",
            "type": "double"
        },
        {
            "name": "writeControl",
            "type": "string"
        },
        {
            "name": "writeInterval",
            "type": "double"
        },
        {
            "name": "purgeWrite",
            "type": "integer"
        },
        {
            "name": "writeFormat",
            "type": "string"
        },
        {
            "name": "writePrecision",
            "type": "integer"
        },
        {
            "name": "writeCompression",
            "type": "string"
        },
        {
            "name": "timeFormat",
            "type": "string"
        },
        {
            "name": "timePrecision",
            "type": "integer"
        },
        {
            "name": "runTimeModifiable",
            "type": "string"
        },
        {
            "name": "adjustTimeStep",
            "type": "string"
        }
    ]
}

</pre>


<p>
Let's save this file under the name '<i>controldict.json</i>'
</p>
</div>

</div>

<div id="outline-container-4-2" class="outline-3">
<h3 id="sec-4-2"><span class="section-number-3">4.2</span> Storing the meta-data</h3>
<div class="outline-text-3" id="text-4-2">


<p>
The next step is to store this data to the meta-data database. We can
do this by using the utility <i>register-entity.sh</i>.
</p>



<pre class="example">$ register-entity.sh controldict.json 

2014/06/20 15:08:27.0408: [16726]: INFO: cluster: Client initialized
in direct mode.
{"name":"controlDict","version":"0.1","description":"Time and data
input/output
control","properties":[{"name":"application","type":"string"},
{"name":"startFrom","type":"string"},{"name":"startTime","type":"double"},
{"name":"stopAt","type":"string"},{"name":"endTime","type":"double"},{"name":
"deltaT","type":"double"},{"name":"writeControl","type":"string"},{"name":
"writeInterval","type":"double"},{"name":"purgeWrite","type":"integer"},
{"name":"writeFormat","type":"string"},{"name":"writePrecision","type":"integer"},
{"name":"writeCompression","type":"string"},{"name":"timeFormat","type":"string"},
{"name":"timePrecision","type":"integer"},{"name":"runTimeModifiable","type":"string"},
{"name":"adjustTimeStep","type":"string"}]}

</pre>



</div>

</div>
