portotools/examples/portoshell/http/html/tutorial.html

<div id="outline-container-4-3" class="outline-3">
<h3 id="sec-4-3"><span class="section-number-3">4.3</span> Instanciate an ControlDict entity</h3>
<div class="outline-text-3" id="text-4-3">


<p>
Now that we have the meta-data available, we can instanciate the
ControlDict object and give it some data:
</p>



<pre class="example">var entity = require('porto.entity').db({
  driver:     'mongodb',
  database:   'porto',
  collection: 'openfoam'
});

ControlDict = entity.using('controlDict', '0.1');

/* Create an instance and give it some data*/
var nozzleControlDict = new ControlDict();
nozzleControlDict.set({
  application       : 'mdFoam',
  startFrom         : 'startTime',
  startTime         : 0,
  stopAt            : 'endTime',
  endTime           : 2e-13,
  deltaT            : 1e-15,
  writeControl      : 'runTime',
  writeInterval     : 5e-14,
  purgeWrite        : 0,    
  writeFormat       : 'ascii',
  writePrecision    : 12,
  writeCompression  : 'off',
  timeFormat        : 'general',
  timePrecision     : '6',
  runTimeModifiable : 'true',    
  adjustTimeStep    : 'no'
});

/* Store the entity in the database */
nozzleControlDict.store();

/* Display the UUID for further use */
print (nozzleControlDict.id);

</pre>


</div>

</div>

<div id="outline-container-4-4" class="outline-3">
<h3 id="sec-4-4"><span class="section-number-3">4.4</span> Create the template view for the generated file</h3>
<div class="outline-text-3" id="text-4-4">


<p>
The next step is to make a template view for the file to be generated.
</p>



<pre class="example">/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.1.1                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
|-----------------------------------------------------------------------------|
    Generated by Porto @{new Date().toString()}
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

application     @{porto.model.application};

startFrom       @{porto.model.startFrom};

startTime       @{porto.model.startTime};

stopAt          @{porto.model.stopAt};

endTime         @{porto.model.endTime};

deltaT          @{porto.model.deltaT};

writeControl    @{porto.model.writeControl};

writeInterval   @{porto.model.writeInterval};

purgeWrite      @{porto.model.purgeWrite};

writeFormat     @{porto.model.writeFormat};

writePrecision  @{porto.model.writePrecision};

writeCompression @{porto.model.writeCompression};

timeFormat      @{porto.model.timeFormat};

timePrecision   @{porto.model.timePrecision};

runTimeModifiable @{porto.model.runTimeModifiable};

adjustTimeStep  @{porto.model.adjustTimeStep};

// ************************************************************************* //

</pre>


</div>

</div>

<div id="outline-container-4-5" class="outline-3">
<h3 id="sec-4-5"><span class="section-number-3">4.5</span> Generate a controlDict file</h3>
<div class="outline-text-3" id="text-4-5">


<p>
The last step is to generate the code that makes the controlDict.
</p>



<pre class="example">
var entity = require('porto.entity').db({
  driver:     'mongodb',
  database:   'porto',
  collection: 'openfoam'});

ControlDict = entity.using('controlDict', '0.1');

var controlDict = new ControlDict('e12686f9-b677-49dc-ad9d-07944f9b053e');
var generate = require('porto.mvc').create({
  model: controlDict.get(),
  view : 'controlDict.foamjs'});

fs.writeFile('controlDict', generate(), function(err){
  if (err) throw (err);
});

</pre>


<p>
Running this script will create a completely heatly OpenFOAM
controlDict dictionary file.
</p>

</div>
</div>

</div>

<div id="outline-container-5" class="outline-2">
<h2 id="sec-5"><span class="section-number-2">5</span> Using UDP to communicate and run external processes</h2>
<div class="outline-text-2" id="text-5">


<p>
The Porto framework is not limited to just storing and retrieving
data. It can also be utilized for controlling the process
workflows. One syncronization mechanism that is supported is <a href="http://en.wikipedia.org/wiki/User_Datagram_Protocol">User Datagram Protocol</a>. This a lightweight protocol with no handshaking and
setup. UDP works by emitting datagrams. The datagram can be any
text. In our example code, we want to create to script
applications. One is the client-code that emits a JSON datagram that
contains some info, along with a program w/arguments that it wants the
receiver to run.
</p>
<p>
The other is the server code. This is a scipt application that creates
a callback that is called when it receives a datagram. It will then
parse the datagram and execute the application. Note that this method
of calling remote procedure is <b>not</b> recommended due to the security
hazard this exposes.
</p>
<p>
UdpSocket is a build-in utility class, and does not require us to call <i>require</i>.
</p>


<pre class="example">__main__ = function (args)
{
  var udpSocket = new UdpSocket();
  var msg = {
      name: "test",
      version: "1.0",
      program: "ls",
      args: ["-al"]
  };
  udpSocket.writeDatagram(JSON.stringify (msg), "127.0.0.1", 1234);
}
</pre>


<p>
When executed, this script will simply emit the datagram and exit. The
server code is a bit more elaborate and contains some features of
Porto that has not yet been discussed. The server is a script that
should set up an event loop. The event loop makes it possible to
create asyncrounous callbacks that is build in the Qt signal/slot
mechanism, and is a build-in utility class called <i>EventLoop</i>.
</p>
<p>
In addition we also need to use the utility class <i>Process</i> which can
control the execution of an application, with asyncronous callback to
catch output coming from stdout, stderr, along with messages giving
the status of the running application, and a callback for the
termination of the application.
</p>




<pre class="example">__main__ = function (args)
{
    /* Create the event loop */
    var event = new EventLoop ();

    var udpSocket = require ('./udpsocket.js');
    var u = udpSocket.create (function (udp) {  
        /* Create a callback for the event 'readyRead' */
        udp.readyRead.connect (function () {

            /* Parse the datagram received and print its contents to the console */
            var datagram = udp.readDatagram ();
            var o = JSON.parse(datagram.datagram);
            print(o.name, o.version, o.program);

            /* Instanciate a new Process and create callbacks for when the process
               starts, have available standard output contents, and termination.
             */ 
            var proc = new Process();
            (function (p) {
                p.started.connect (function (){
                    print ("process started");
                });

                p.readyReadStandardOutput.connect (function() {
                    print (p.readAllStandardOutput ());
                });

                p["finished(int)"].connect (function (){
                    print ("process finished");
                    event.quit(); /* Quit the server when the program finishes*/
                });
            })(proc);

            /* Set up the process with the program and arguments given in the datagram */
            proc.setProgram(o.program);
            proc.setArguments(o.args);

            /* Run the application */
            proc.start();
        });
    });

    /* Make the socket listen for activity on port 1234 coming from localhost */
    u.bind ("127.0.0.1", 1234);

    /* Enter the event loop */
    event.exec();
}
</pre>


<p>
The module udpsocket.js is just a simple high-level function that
instanciates the UdpSocket and pass it to a function argument.
</p>



<pre class="example">exports.create = function(fn) {
    var udp = new UdpSocket();
    fn (udp);

    return udp;
}
</pre>


</div>

</div>
