portotools/examples/portoshell/http/html/tutorial.html

<div id="outline-container-6" class="outline-2">
<h2 id="sec-6"><span class="section-number-2">6</span> Displaying contents in a web browser</h2>
<div class="outline-text-2" id="text-6">


<p>
Working in a scripting shell environment is sometimes not practical
when it comes to presenting information. Creating or generating HTML
for presenting contents is therefore good options. One could also
consider to build <i>Porto User Interfaces</i> as web services. This
chapter will demonstrate the functionality of the tiny webserver
functionality available in <i>Porto</i>, in the build-in utility HttpServer.
</p>



<pre class="example">__main__ = function (args)
{
  var event = new EventLoop();
  var port  = 8081;
  var httpd = new HttpServer(port);
  httpd.setRootDir("html/");
  httpd.start();
  event.exec();
}
</pre>


<p>
By pointing the browser to <a href="http://localhost:8081">http://localhost:8081</a> we should now be able
to view the contents defined under the given root directory. 
</p>
<p>
Note hoewever, that is not a production web server, and it is limited
to GET requests of type text/html.
</p>
</div>

</div>

<div id="outline-container-7" class="outline-2">
<h2 id="sec-7"><span class="section-number-2">7</span> Final notes</h2>
<div class="outline-text-2" id="text-7">


<p>
This tutorial/overview was intended to give the reader some hands-on
to get started on working with Porto. There are many more things that
Porto is able to do in terms of features, but the key concepts are the
most important. I wish this document has left the reader with a little
deeper understanding of the data-centric design philosophy, and also
inspiration to contribute and extend the framework to fit other tasks
and activities. After all, software is supposed to make work easier,
more fun, and inspire new ideas.
</p>
<p>
Also note that Porto is in a <b>very early stage of development</b>. Do not
expect everything to be smooth and easy, but please make a note of
annoyances, problems, improvement suggestions, and feel free to make
these requirements for the development interation.
</p>
<p>
Thomas Hagelien
Trondheim 2014
</p></div>
</div>
</div>

<div id="postamble">
<p class="date">Date: 2014-06-20T18:48+0200</p>
<p class="author">Author: Thomas Hagelien</p>
<p class="creator"><a href="http://orgmode.org">Org</a> version 7.9.3f with <a href="http://www.gnu.org/software/emacs/">Emacs</a> version 24</p>
<a href="http://validator.w3.org/check?uri=referer">Validate XHTML 1.0</a>

</div>
</body>
</html>
